# -*- ii: apisnoop; -*-
#+TITLE: Deployment Apps endpoints
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
#+PROPERTY: header-args:sql-mode :product postgres

*** 1. Create a deployment yaml file, namespace and Deployment

#+begin_src yaml :tangle deployment_test.yaml
apiVersion: apps/v1
kind: Deployment
metadata:
  name: nginx-deployment
  labels:
    app: nginx
spec:
  replicas: 3
  selector:
    matchLabels:
      app: nginx
  template:
    metadata:
      labels:
        app: nginx
    spec:
      containers:
      - name: nginx
        image: nginx:1.14.2
        ports:
        - containerPort: 80
#+end_src

- Tangle to create the .yaml file - `,bt`


- See if the yaml file was created
#+begin_src shell :results raw
  pwd
 ls -al /home/riaan/Project/ticket-writing |grep .yaml

 #ls -al /home/ii/ticket-writing | grep yaml
#+end_src

#+RESULTS:
#+begin_example
/home/riaan/Project/ticket-writing
-rw-rw-r--  1 riaan riaan    404 Dec 11 06:39 deployment_test.yaml
-rw-rw-r--  1 riaan riaan    455 Dec 11 10:28 replicaset_test.yaml
-rw-rw-r--  1 riaan riaan   1029 Dec 11 06:39 statefulset_test.yaml
#+end_example





- Create a Namespace
#+begin_src shell :results raw
kubectl create namespace app-deploy-tests
#+end_src

#+RESULTS:
#+begin_example
namespace/app-deploy-tests created
#+end_example


- Create a Deployment
#+begin_src shell :results raw
kubectl apply -f deployment_test.yaml --namespace=app-deploy-tests
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/nginx-deployment created
#+end_example



***  2. Find the deployment
#+begin_src shell :results raw
  kubectl get deployments -A | grep app
#+end_src

#+RESULTS:
#+begin_example
app-deploy-tests     nginx-deployment         3/3     3            3           87s
#+end_example




*** 3. Scale the Deployment

#+begin_src shell :results raw
  kubectl scale deployment.v1.apps/nginx-deployment -n app-deploy-tests --replicas=4
  sleep 5
  kubectl get deployments -A | grep app
  kubectl rollout status deployment.v1.apps/nginx-deployment -n app-deploy-tests
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/nginx-deployment scaled
app-deploy-tests     nginx-deployment         4/4     4            4           103s
deployment "nginx-deployment" successfully rolled out
#+end_example





*** 4. Update the deployment:
#+begin_src shell :results raw
kubectl set image deployment.v1.apps/nginx-deployment -n app-deploy-tests nginx=nginx:1.16.0 --record
#+end_src

#+RESULTS:
#+begin_example
#+end_example






- and update it agaian, because we can...

#+begin_src shell :results raw
kubectl set image deployment.v1.apps/nginx-deployment -n app-deploy-tests nginx=nginx:1.16.1 --record
#+end_src

#+RESULTS:
#+begin_example
deployment.apps/nginx-deployment image updated
#+end_example




*** 5. Describe the deployments to see if it was updated with history
#+begin_src shell :results raw
  kubectl describe deployments -n app-deploy-tests | grep image
  kubectl rollout history deployment.v1.apps/nginx-deployment -n app-deploy-tests
#+end_src

#+RESULTS:
#+begin_example
                          kubectl set image deployment.v1.apps/nginx-deployment nginx=nginx:1.16.1 --namespace=app-deploy-tests --record=true
deployment.apps/nginx-deployment
REVISION  CHANGE-CAUSE
1         <none>
2         kubectl set image deployment.v1.apps/nginx-deployment nginx=nginx:1.16.0 --namespace=app-deploy-tests --record=true
3         kubectl set image deployment.v1.apps/nginx-deployment nginx=nginx:1.16.1 --namespace=app-deploy-tests --record=true

#+end_example




*** 7. The following kubectl command sets the spec with progressDeadlineSeconds to make the controller report lack of progress for a Deployment after 1 minute:

#+begin_src shell :results raw
  #This command fail!
  (

      kubectl patch deployment.v1.apps/nginx-deployment -p -n app-deploy-tests '{"spec":{"progressDeadlineSeconds":60}}'


  ) 2>&1
  :
#+end_src

#+RESULTS:
#+begin_example
error: there is no need to specify a resource type as a separate argument when passing arguments in resource/name form (e.g. 'kubectl get resource/<resource_name>' instead of 'kubectl get resource resource/<resource_name>'
#+end_example




*** 8. Cleanup


- Delete the deployment and the namespace
#+begin_src shell :results raw
  kubectl delete deploy/deployment.v1.apps/nginx-deployment
  kubectl delete namespaces/app-deploy-tests

#+end_src

#+RESULTS:
#+begin_example
namespace "app-deploy-tests" deleted
#+end_example



- Look for deployment and namespace to check if it is deleted

#+begin_src shell :results raw
  kubectl get namespace app-deploy-tests
  kubectl get deployment nginx-deployment
#+end_src


- ALL DONE!



* Verifying increase in coverage with APISnoop                       :export:
Discover useragents:
  #+begin_src sql-mode :eval never-export :exports both :session none
    select distinct useragent
      from testing.audit_event
      where useragent like 'live%';
  #+end_src

  #+RESULTS:
  :  useragent
  : -----------
  : (0 rows)
  :

List endpoints hit by the test:
#+begin_src sql-mode :exports both :session none
select * from testing.endpoint_hit_by_new_test;
#+end_src

#+RESULTS:
#+begin_SRC example
 useragent | endpoint | hit_by_ete | hit_by_new_test
-----------+----------+------------+-----------------
(0 rows)

#+end_SRC

Display endpoint coverage change:
  #+begin_src sql-mode :eval never-export :exports both :session none
    select * from testing.projected_change_in_coverage;
  #+end_src

  #+RESULTS:
  #+begin_SRC example
     category    | total_endpoints | old_coverage | new_coverage | change_in_number
  ---------------+-----------------+--------------+--------------+------------------
   test_coverage |             862 |          343 |          343 |                0
  (1 row)

  #+end_SRC

